{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: adding 30 new certification images to CertificationsGallery component and configuring them as static assets in frontend/public/assets/.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing component purposes, including the CertificationsGallery with 54 total certification images and modal functionality.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system variables for light and dark themes with custom design tokens for background, foreground, borders, and chart colors.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag, page title, root div, and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main application component that renders the complete portfolio layout including HeroSection, ProfessionalSummary, CoreCompetencies, Education, ProfessionalCertifications, ProfessionalExperience, ResearchPapers, Interests, CertificationsGallery, and Footer in sequence.",
  "frontend/src/components/CertificateModal.tsx": "Full-screen modal component for viewing certificate images with close button, previous/next navigation, keyboard shortcuts (Escape, ArrowLeft, ArrowRight), and accessible ARIA attributes.",
  "frontend/src/components/CertificationsGallery.tsx": "Gallery component displaying 54 professional certification images in a responsive grid with hover effects and click-to-expand modal functionality using CertificateModal.",
  "frontend/src/components/CoreCompetencies.tsx": "Section component displaying nine core technical competencies in a responsive grid with icons, hover effects, and teal accent colors.",
  "frontend/src/components/Education.tsx": "Section component listing three educational qualifications in reverse chronological order with graduation cap icons and institution details.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright notice, current year, and attribution link to caffeine.ai with UTM tracking parameters derived from hostname.",
  "frontend/src/components/HeroSection.tsx": "Displays the hero banner with Jerry Osiobe's headshot, name, professional credentials (MNSE, COREN), and contact information (email, phone, location) with animated background effects.",
  "frontend/src/components/Interests.tsx": "Renders a grid of personal interests (Reading, Learning, Swimming, Travelling, Football) with corresponding icons in styled cards.",
  "frontend/src/components/ProfessionalCertifications.tsx": "Displays categorized professional certifications across six domains: Engineering Memberships, Project & Risk Management, Data & AI, Cybersecurity, Process Improvement, and Technical Courses.",
  "frontend/src/components/ProfessionalExperience.tsx": "Shows a timeline of six professional positions with company names, dates, and key responsibilities, including current role as Fabrication Engineer and previous positions in cybersecurity, data analysis, and network support.",
  "frontend/src/components/ProfessionalSummary.tsx": "Presents a brief professional summary highlighting Jerry Osiobe's expertise in Materials & Metallurgical Engineering, Project Management, Cybersecurity, Data Analytics, and technical skills.",
  "frontend/src/components/ResearchPapers.tsx": "Lists five research papers/publications with titles and DOI links covering topics like CCTV systems, business continuity planning, and mathematical systems.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance based on Internet Identity authentication state, creating authenticated or anonymous actors and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating that the portfolio uses static content without backend queries.",
  "frontend/src/index.css": "Global CSS file defining Tailwind directives, CSS custom properties for light/dark theme color palettes (slate and teal), typography styles for headings and paragraphs, and a utility class for grid background patterns.",
  "frontend/src/main.tsx": "Application entry point that renders the React app with QueryClient and InternetIdentityProvider wrappers for state management and authentication.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH color system, container settings, border radius variables, box shadows, and animation keyframes for accordions and other UI elements.",
  "project_state.json": "Project metadata defining a professional portfolio website for Engr. Jerry Osiobe with sections for hero, summary, competencies, education, certifications, experience, publications, and interests, featuring timeline layouts and certification gallery."
}