{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: CV download button in HeroSection and its responsive design across screen sizes, both with high confidence and associated test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend component files describing the portfolio application structure, including hero section, certifications gallery with modal, and various content sections.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining OKLCH color system for light and dark themes, including background, foreground, card, and accent colors.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main application component that renders the complete portfolio layout including hero section, professional sections, certifications gallery, and footer in sequence.",
  "frontend/src/components/CertificateModal.tsx": "Full-screen modal component for viewing certificates with navigation controls (previous/next buttons), keyboard support (Escape, arrow keys), and accessibility features.",
  "frontend/src/components/CertificationsGallery.tsx": "Gallery component displaying 54 professional certification images in a responsive grid with click-to-expand modal functionality and state management for selected certificate.",
  "frontend/src/components/CoreCompetencies.tsx": "Section component displaying nine technical competencies in a responsive grid with icons, including project management, CAD design, cybersecurity, and data analytics skills.",
  "frontend/src/components/Education.tsx": "Education section listing three academic qualifications (B.Eng, OND, and secondary certificates) with institution names and graduation years in card format.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright notice and attribution link to caffeine.ai with UTM tracking parameters derived from hostname.",
  "frontend/src/components/HeroSection.tsx": "Displays the hero banner with profile image, name, credentials (MNSE, COREN), contact information (email, phone, location), and a CV download button with gradient background and animations.",
  "frontend/src/components/Interests.tsx": "Renders a grid of personal interests (Reading, Learning, Swimming, Travelling, Football) with corresponding icons in styled cards.",
  "frontend/src/components/ProfessionalCertifications.tsx": "Displays professional certifications organized into six categories (Engineering Memberships, Project & Risk Management, Data & AI, Cybersecurity, Process Improvement, Technical Courses) with icons and detailed lists.",
  "frontend/src/components/ProfessionalExperience.tsx": "Shows a timeline of work experience entries with company names, job titles, periods, and responsibilities, featuring a visual timeline on larger screens.",
  "frontend/src/components/ProfessionalSummary.tsx": "Presents a brief professional summary paragraph highlighting expertise in Materials & Metallurgical Engineering, Project Management, Cybersecurity, and Data Analytics.",
  "frontend/src/components/ResearchPapers.tsx": "Lists five research papers with titles and DOI links that open externally, styled as interactive cards with icons.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages ICP backend actor creation based on Internet Identity authentication state, using React Query for caching and invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality using DFINITY's AuthClient, managing identity state and login status throughout the application.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating the portfolio uses static content without backend queries.",
  "frontend/src/index.css": "Global CSS file defining Tailwind directives, CSS custom properties for light/dark theme colors using OKLCH color space, base typography styles for headings and paragraphs, and utility classes including a grid pattern background.",
  "frontend/src/main.tsx": "Application entry point that renders the React app with QueryClient and InternetIdentityProvider wrappers, mounting to the root DOM element.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based color system, container settings, border radius variables, custom shadows, and keyframe animations for accordions and other UI elements.",
  "project_state.json": "Project state document describing a professional portfolio website for Engr. Jerry Ebruvwiyor Osiobe with sections for hero, summary, competencies, education, certifications, experience, publications, and interests, including architectural notes and existing feature definitions."
}