{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no implemented functionality.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "JSON-formatted metadata file containing summaries of all frontend component files, hooks, and configuration files for the portfolio application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining OKLCH color system for light and dark themes, including background, foreground, card, and accent colors.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component that renders the complete portfolio layout by composing all section components (Hero, Summary, Competencies, Education, Certifications, Experience, Research, Interests, Gallery, Footer) in sequence.",
  "frontend/src/components/CertificateModal.tsx": "Full-screen modal component for viewing certificate images with navigation controls (previous/next arrows), keyboard shortcuts (Escape, Arrow keys), and accessibility features.",
  "frontend/src/components/CertificationsGallery.tsx": "Gallery component displaying 54 professional certification images in a responsive grid with click-to-expand modal functionality and navigation between certificates.",
  "frontend/src/components/CoreCompetencies.tsx": "Section component displaying nine core technical competencies in a responsive grid with icons, including project management, CAD design, cybersecurity, data analytics, and networking skills.",
  "frontend/src/components/Education.tsx": "Section component listing three educational qualifications (B.Eng, OND, SSCE) with institution names and graduation years in card format.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright notice and attribution link to caffeine.ai with UTM tracking parameters based on hostname.",
  "frontend/src/components/HeroSection.tsx": "Hero banner component featuring engineer's name, credentials (MNSE, COREN), professional headshot, contact information (email, phone, location), and gradient background with overlay pattern.",
  "frontend/src/components/Interests.tsx": "Displays a grid of personal interests (Reading, Learning, Swimming, Travelling, Football) with icons from lucide-react. Each interest is shown in a card with hover effects and teal accent colors.",
  "frontend/src/components/ProfessionalCertifications.tsx": "Renders professional certifications grouped into six categories (Engineering Memberships, Project & Risk Management, Data & AI, Cybersecurity, Process Improvement, Technical Courses). Each category displays as a card with an icon and a list of certification items.",
  "frontend/src/components/ProfessionalExperience.tsx": "Shows a timeline of professional work experience with six positions from 2017 to present. Each entry includes job title, company, period, and responsibilities with a vertical timeline design for larger screens.",
  "frontend/src/components/ProfessionalSummary.tsx": "Displays a brief professional summary paragraph highlighting expertise in Materials & Metallurgical Engineering, Project Management, Cybersecurity, and Data Analytics. Rendered as a centered card with styled typography.",
  "frontend/src/components/ResearchPapers.tsx": "Lists five research papers/publications with titles and DOI links. Each paper is displayed in a card with an icon and an external link to the DOI resolver.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity login state. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP integration, managing login state, identity persistence, and AuthClient lifecycle. Exports InternetIdentityProvider component and useInternetIdentity hook.",
  "frontend/src/hooks/useQueries.ts": "Empty file placeholder indicating that the portfolio uses static content without backend queries. All data is hardcoded from resume information.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light and dark themes using a slate and teal color palette. Includes base styles for typography, spacing, and a grid background pattern utility.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for ICP authentication. Renders the main App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system, container settings, border radius variables, custom shadows, and keyframe animations for accordion and other UI components.",
  "project_state.json": "Project state file documenting a single-page portfolio website for Engr. Jerry Ebruvwiyor Osiobe with sections for hero, summary, competencies, education, certifications, experience, publications, and interests, tracking 11 implemented features across version 11."
}