{
  "backend/main.mo": "Main Motoko actor implementing role-based access control and blob storage mixins, with user profile management and certificate upload/retrieval functionality.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features documented.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend components including hero, professional sections, certifications gallery, and upload functionality with authentication.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for background, foreground, borders, and component colors.",
  "frontend/index.html": "HTML entry point for the portfolio application with viewport meta tag and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root React component wrapping the portfolio with ThemeProvider and Toaster, rendering all sections including hero, experience, certifications, and upload folder.",
  "frontend/src/components/CertificateModal.tsx": "Full-screen modal component for viewing certificates with keyboard navigation (Escape, arrow keys), prev/next buttons, and image counter display.",
  "frontend/src/components/CertificatesFolder.tsx": "Certificate upload and display component with Internet Identity authentication, file validation (10MB max, JPEG/PNG/PDF), progress tracking, and integration with backend queries.",
  "frontend/src/components/CertificationsGallery.tsx": "Empty component file for certifications gallery (content truncated or removed).",
  "frontend/src/components/CoreCompetencies.tsx": "Grid display of nine core technical competencies with icons including project management, AutoCAD, cybersecurity, data analytics, and networking.",
  "frontend/src/components/Education.tsx": "Education timeline displaying four academic qualifications from MSc (in view) to SSCE with institutions and graduation years.",
  "frontend/src/components/Footer.tsx": "Footer component with copyright notice and attribution link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/HeroSection.tsx": "Displays a hero banner with Jerry Osiobe's headshot, name, credentials (MNSE, COREN), and contact information (email, phone, location) over a gradient background with decorative overlays.",
  "frontend/src/components/Interests.tsx": "Renders a grid of personal interests (Reading, Learning, Swimming, Travelling, Football) with corresponding icons in styled cards.",
  "frontend/src/components/ProfessionalCertifications.tsx": "Displays categorized professional certifications and memberships across six areas: Engineering Memberships, Project & Risk Management, Data & AI, Cybersecurity, Process Improvement, and Technical Courses.",
  "frontend/src/components/ProfessionalExperience.tsx": "Shows a timeline of six professional roles with company names, dates, and key responsibilities, including current position as Fabrication Engineer and past roles in cybersecurity, data analysis, and network support.",
  "frontend/src/components/ProfessionalSummary.tsx": "Presents a brief professional summary highlighting expertise in Materials & Metallurgical Engineering, Project Management, Cybersecurity, Data Analytics, and related technical skills.",
  "frontend/src/components/ResearchPapers.tsx": "Lists five research papers/publications with titles and DOI links covering topics like CCTV systems, business continuity, environmental impact assessment, and mathematical systems.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance, creating it with the current Internet Identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality using DFINITY's AuthClient, with configurable options for identity management.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching certificates, uploading certificates, and managing user profiles through the backend actor with automatic cache invalidation.",
  "frontend/src/index.css": "Global CSS file defining Tailwind directives, CSS custom properties for light/dark theme color palettes (using OKLCH color space), and base styles for typography and layout including a grid pattern utility.",
  "frontend/src/main.tsx": "Application entry point that renders the React app with QueryClient and InternetIdentityProvider wrappers for state management and authentication.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based color system, container settings, border radius variables, shadows, and animation keyframes for accordion and other UI components.",
  "project_state.json": "Project metadata defining a professional portfolio website for Engr. Jerry Ebruvwiyor Osiobe with sections for hero, summary, competencies, education, certifications, experience, publications, and interests in a single-page layout."
}