{
  "backend/main.mo": "Main Motoko actor implementing role-based access control and blob storage mixins, with user profile management and certificate upload/retrieval functionality restricted by permissions.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of 16 frontend component files describing a portfolio application with hero section, certifications, education, experience, and certificate upload functionality.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for background, foreground, borders, and component colors.",
  "frontend/index.html": "HTML entry point for Jerry Osiobe's portfolio application with root div and module script reference.",
  "frontend/src/App.tsx": "Root React component wrapping the portfolio application with ThemeProvider and Toaster, rendering all section components including hero, certifications, experience, and certificates folder.",
  "frontend/src/components/CertificateModal.tsx": "Full-screen modal component for viewing certificates with keyboard navigation (Escape, arrow keys), previous/next buttons, image counter, and accessibility attributes.",
  "frontend/src/components/CertificatesFolder.tsx": "Certificate management component with Internet Identity authentication, file upload with validation (10MB max, JPEG/PNG/PDF), progress tracking, and grid display of uploaded certificates with modal viewing.",
  "frontend/src/components/CertificationsGallery.tsx": "Empty file with no content.",
  "frontend/src/components/CoreCompetencies.tsx": "Responsive grid section displaying nine core technical competencies with icons (project management, AutoCAD, cybersecurity, data analytics, etc.) and hover effects.",
  "frontend/src/components/Education.tsx": "Education section listing four academic qualifications in card format with graduation cap icons, institution names, and years (MSc in view, B.Eng, OND, SSCE).",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright notice for Jerry Osiobe and attribution link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/HeroSection.tsx": "Displays a hero banner with profile image, name, credentials (MNSE, COREN), and contact information (email, phone, location) over a gradient background with decorative overlays.",
  "frontend/src/components/Interests.tsx": "Renders a grid of personal interests (Reading, Learning, Swimming, Travelling, Football) with icons in styled cards.",
  "frontend/src/components/ProfessionalCertifications.tsx": "Displays categorized professional certifications including engineering memberships, project management, data/AI, cybersecurity, process improvement, and technical courses in a two-column grid layout.",
  "frontend/src/components/ProfessionalExperience.tsx": "Shows a timeline of work experience entries with job titles, companies, periods, and responsibilities, featuring a visual timeline line on larger screens.",
  "frontend/src/components/ProfessionalSummary.tsx": "Presents a brief professional summary paragraph highlighting engineering expertise, skills, and key competencies in a styled card.",
  "frontend/src/components/ResearchPapers.tsx": "Lists published research papers with titles and DOI links, each displayed in a card with external link icons.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance, handling authentication state with Internet Identity and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching certificates, uploading certificates, and managing user profiles using the backend actor with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a sophisticated slate and teal color palette for light and dark modes, including sidebar, chart, and semantic color tokens, plus base typography styles and a grid pattern utility.",
  "frontend/src/main.tsx": "Application entry point that renders the React app with QueryClient and InternetIdentityProvider wrappers for state management and authentication.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and managing URL parameters from both query strings and hash-based routing, with sessionStorage integration for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the theme with custom OKLCH color system, container settings, border radius variables, custom shadows including teal-glow, and animation keyframes for accordion and other UI effects.",
  "project_state.json": "Project state document describing a professional portfolio website for Engr. Jerry Ebruvwiyor Osiobe with sections for hero, summary, competencies, education, certifications, experience, publications, and interests in a single-page scrolling layout."
}