{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add downloadable CV to portfolio",
  "requirements": [
    {
      "id": "REQ-22",
      "summary": "Add CV PDF file as a static asset in the frontend public assets directory",
      "acceptanceCriteria": [
        "CV PDF file is stored in frontend/public/assets/ directory",
        "File is accessible via the frontend public assets path"
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/Engr-Jerry-E-Osiobe-CV.pdf",
          "operation": "create",
          "description": "Copy the uploaded CV file (Engr. Jerry E. Osiobe CV.pdf) to the frontend public assets directory. Rename to Engr-Jerry-E-Osiobe-CV.pdf (with hyphens instead of spaces) for web-safe URL access. This file will be served as a static asset accessible at /assets/Engr-Jerry-E-Osiobe-CV.pdf"
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Add download CV button to HeroSection component that triggers PDF download on click",
      "acceptanceCriteria": [
        "Download button is visually integrated into the HeroSection component near contact information",
        "Button has appropriate icon (e.g., Download icon from lucide-react)",
        "Clicking the button initiates download of the CV PDF file",
        "Button styling matches the portfolio's design system with teal accent colors",
        "Button includes accessible label text such as 'Download CV' or 'Download Resume'"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HeroSection.tsx",
          "operation": "modify",
          "description": "Add a download CV button below the contact information section. Import Download icon from lucide-react. Create a button element with an anchor tag linking to /assets/Engr-Jerry-E-Osiobe-CV.pdf with download attribute set to the filename. Style the button with teal accent colors matching the existing design system (bg-teal-600 hover:bg-teal-700, text-white). Include the Download icon and 'Download CV' text label. Position the button prominently within the hero layout, ensuring it integrates visually with the existing contact information display"
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Ensure CV download button is responsive across all screen sizes",
      "acceptanceCriteria": [
        "Button is visible and accessible on all screen sizes",
        "Button positioning adapts to the responsive layout of the HeroSection",
        "Touch targets meet mobile usability standards (minimum 44x44px)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/HeroSection.tsx",
          "operation": "modify",
          "description": "Apply responsive styling to the CV download button using Tailwind CSS breakpoint classes. Ensure button has adequate padding (e.g., px-6 py-3) to meet minimum 44x44px touch target for mobile. Use responsive layout utilities (flex, items-center, justify-center) to adapt button positioning for mobile (full-width or centered), tablet (inline with other elements), and desktop (integrated with contact information). Test that the button remains accessible and visually prominent across sm:, md:, and lg: breakpoints while maintaining the HeroSection's existing responsive layout"
        }
      ]
    }
  ]
}